---
title: "Column Rename"
author: "Kamal"
date: 2020-08-11
description: "-"
type: technical_note
draft: false
---

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {"Dialogue1": ["Vachitaya aapuuuuuuuuu","Sing in the rain","Valikudhu...Aludhuruve","Mande Badharam"], "Num1" : [11,12,13,14]}

In [3]:
df = pd.DataFrame(d)
df

                Dialogue1  Num1
0  Vachitaya aapuuuuuuuuu    11
1        Sing in the rain    12
2  Valikudhu...Aludhuruve    13
3          Mande Badharam    14

In [4]:
df.columns = ["Dialogue2", "Num2"]
df

                Dialogue2  Num2
0  Vachitaya aapuuuuuuuuu    11
1        Sing in the rain    12
2  Valikudhu...Aludhuruve    13
3          Mande Badharam    14

In [5]:
df.rename(columns = {"Dialogue2":"Dialogue3"},inplace = True)
df

                Dialogue3  Num2
0  Vachitaya aapuuuuuuuuu    11
1        Sing in the rain    12
2  Valikudhu...Aludhuruve    13
3          Mande Badharam    14